УТ_для_edt.РасширениеСмарт/src/InformationRegisters/смартИдентификаторыСоответствияБитрикс/смартИдентификаторыСоответствияБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e73d00f7-5769-4608-9c25-45cef0769d61">
  <name>смартИдентификаторыСоответствияБитрикс</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="1108660d-814d-4d98-bdc2-94a89bc145c5">
    <name>ГУИД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="b4ff496b-7478-4e3c-a3d5-a8943f81b5e7">
    <name>СсылкаМет</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bcf78ec-daf5-4eac-b38c-85fe3f01e92c">
    <name>ИДсайта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/HTTPServices/shop/Module.bsl
#Область ТочкиВхода

Функция stockPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ДанныеЗапроса=Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type","text/html;charset=utf-8");
	Если ДанныеЗапроса=Неопределено Тогда 
		Ответ.УстановитьТелоИзСтроки("Данные не получены",КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	Ответ.УстановитьТелоИзСтроки(ПолучитьОстаткиНоменклатурыПоСкладам(ДанныеЗапроса),КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции

Функция new_contragentPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ДанныеЗапроса=Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type","text/html;charset=utf-8");
	Если ДанныеЗапроса=Неопределено Тогда 
		Ответ.УстановитьТелоИзСтроки("Данные не получены",КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартИнтернетМагазин.ПолучениеНовыхОбъектовССайта",Новый Структура("Ресурс","contragent"),ПараметрыВыполнения);
	
	Ответ.УстановитьТелоИзСтроки("{result: {status: 'OK', info: 'start of information contragents'}}",КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции

Функция usersPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ДанныеЗапроса=Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type","text/html;charset=utf-8");
	Если ДанныеЗапроса=Неопределено Тогда 
		Ответ.УстановитьТелоИзСтроки("Данные не получены",КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 9:53:12
	//Убрал создание фонового задания из-за накопления повторяющихся сообщений с Ид пользователей
	ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартИнтернетМагазин.ПолучениеНовыхОбъектовССайта",Новый Структура("Ресурс","user"),ПараметрыВыполнения);
	//
	//ПараметрыПроцедуры=Новый Структура;
	//ПараметрыПроцедуры.Вставить("Ресурс","user");
	//смартИнтернетМагазин.ПолучениеНовыхОбъектовССайта(ПараметрыПроцедуры,Неопределено);
	
	Ответ.УстановитьТелоИзСтроки("{result: {status: 'OK', info: 'start of information users'}}",КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции	

Функция orderPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ДанныеЗапроса=Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type","text/html;charset=utf-8");
	
	//++ #Б3696 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. Модуль обмена с Битрикс. Рефакторинг и обновление 
	//обмен по событию создания заказа на сайте отключен. Обмен идет только по регл.заданию по расписанию.
	Ответ.УстановитьТелоИзСтроки("{result: {status: 'OK', info: 'start of order exchange'}}", КодировкаТекста.UTF8);
	Возврат Ответ;
	//-- #Б3696 смарт: Шляпников 03.07.2025
	
	Если ДанныеЗапроса=Неопределено Тогда 
		Ответ.УстановитьТелоИзСтроки("Данные не получены",КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартИнтернетМагазин.ПолучениеНовыхОбъектовССайта",Новый Структура("Ресурс","order"),ПараметрыВыполнения);
	
	Ответ.УстановитьТелоИзСтроки("{result: {status: 'OK', info: 'start of order exchange'}}",КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции

Функция payments_customerPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ДанныеЗапроса=Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type","text/html;charset=utf-8");
	Если ДанныеЗапроса=Неопределено Тогда 
		Ответ.УстановитьТелоИзСтроки("Данные не получены",КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ПолучитьВзаиморасчетыСКлиентами(ДанныеЗапроса),КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции

Функция new_subscribePOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ДанныеЗапроса=Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type","text/html;charset=utf-8");
	Если ДанныеЗапроса=Неопределено Тогда 
		Ответ.УстановитьТелоИзСтроки("Данные не получены",КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	

КонецФункции

//++#1311 смарт: Лопато 03.04.2023 //Изменить форму Счета на оплату (Счет-оферта)  
Функция order_offerPOST(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	ДанныеЗапроса=Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type","text/html;charset=utf-8");
	Если ДанныеЗапроса=Неопределено Тогда 
		Ответ.УстановитьТелоИзСтроки("Данные не получены",КодировкаТекста.UTF8);
		Возврат Ответ;
	КонецЕсли;
	Ответ.УстановитьТелоИзСтроки(ПолучитьТекстОфертыЗаказаДляСайта(ДанныеЗапроса),КодировкаТекста.UTF8);
	Возврат Ответ;

КонецФункции //--#1311 смарт: Лопато 03.04.2023

//++ #Б-1368 смарт: Лопато 19.11.2024 //Печать счета по форме 1С из ИМ. Подготовить API для выгрузки файла Счета-оферты в PDF.  
Функция invoicePOST(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	
	ДанныеЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	Попытка
   		Данные = СтрокуJSONВДанные(ДанныеЗапроса);
	Исключение
        Данные = Неопределено;
	КонецПопытки;	
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		
		УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "Данные не получены");
		
		Возврат Ответ;
		
	КонецЕсли;
	
	ДокЗаказ = Неопределено;

	Если Данные.Свойство("order") 
		И ЗначениеЗаполнено(Данные.order) Тогда
		
		Попытка

			ДокЗаказ = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.order));
			
		Исключение
			
			УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "GUID заказа не корректен");
			
			Возврат Ответ;
			
		КонецПопытки;	
		
	Иначе
		
		УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "GUID заказа не заполнен");

		Возврат Ответ;
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДокЗаказ) Тогда

		УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "Заказ клиента " + Данные.order + " не найден");
		
	Иначе		
		
		ТабДокСчетНаОплату = смартИнтернетМагазин.СформироватьПечатнуюФормуСчетаНаОплату(ДокЗаказ);
		
		Если ТипЗнч(ТабДокСчетНаОплату) = Тип("ТабличныйДокумент") Тогда
			
			СчетНаОплатуПоток = Новый ПотокВПамяти();
			
			ТабДокСчетНаОплату.Записать(СчетНаОплатуПоток, ТипФайлаТабличногоДокумента.PDF);
			
			СчетНаОплатуДвоичныеДанные = СчетНаОплатуПоток.ЗакрытьИПолучитьДвоичныеДанные();
			
			Ответ.УстановитьТелоИзДвоичныхДанных(СчетНаОплатуДвоичныеДанные);
			
		Иначе

			УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "Ошибка формирования счета на оплату " + СокрЛП(ДокЗаказ));
			
		КонецЕсли;	

	КонецЕсли;	

	Возврат Ответ;
	
КонецФункции //-- #Б-1368 смарт: Лопато 19.11.2024

//++ #Б-1652 смарт: Лопато 18.12.2024 //Добавить раздел "Мое оборудование". Создать ветку API, подготовить структуру ответа  
Функция GetSalesInfo(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	
	ДанныеЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	Попытка
   		Данные = СтрокуJSONВДанные(ДанныеЗапроса);
	Исключение
        Данные = Неопределено;
	КонецПопытки;	
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		
		УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "Данные не получены");
		
		Возврат Ответ;
		
	КонецЕсли;
	
	Партнер = Неопределено;

	Если Данные.Свойство("PARTNER_XML_ID") 
		И ЗначениеЗаполнено(Данные.PARTNER_XML_ID) Тогда
		
		Попытка

			Партнер = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.PARTNER_XML_ID));
			
		Исключение
			
			УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "GUID партнера не корректен");
			
			Возврат Ответ;
			
		КонецПопытки;	
		
	Иначе
		
		УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "GUID партнера не заполнен");

		Возврат Ответ;
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда

		УстановитьВОтветСообщениеОбОшибке(Ответ, 207, "Партнер " + Данные.PARTNER_XML_ID + " не найден");
		
	Иначе		
		
		Данные = ПолучитьДанныеПоОборудованиюПартнера(Партнер);
		
		Ответ.УстановитьТелоИзСтроки(Данные, КодировкаТекста.UTF8);
		
	КонецЕсли;	

	Возврат Ответ;
	
КонецФункции //-- #Б-1652 смарт: Лопато 18.12.2024

#КонецОбласти


#Область ПолучениеДанныхДляОтвета

Функция ПолучитьОстаткиНоменклатурыПоСкладам(ДанныеЗапроса)
	УстановитьПривилегированныйРежим(Истина);
	Запрос=Новый Запрос;
	
	Данные=СтрокуJSONВДанные(ДанныеЗапроса);
	
	Склады=Неопределено;
	Если Не (Данные.Свойство("stores",Склады) И ТипЗнч(Склады)=Тип("Массив")) Тогда 
		Склады=Новый Массив;
	КонецЕсли;
	
	Товары1=Неопределено;
	Если Не (Данные.Свойство("products",Товары1) И ТипЗнч(Товары1)=Тип("Массив")) Тогда  
		Товары1=Новый Массив;
	КонецЕсли;		
    
    Характеристики=Неопределено;
    Товары=Неопределено;
    Если Товары1.Количество() Тогда 
        Характеристики=Новый ТаблицаЗначений;
        Характеристики.Колонки.Добавить("Товар");
        Характеристики.Колонки.Добавить("Характеристика");
        Товары=Новый Массив;
        Для каждого Стр Из Товары1 Цикл 
            МассивРазделительНХ=СтрРазделить(Стр,"#",Ложь); 
            Если МассивРазделительНХ.Количество()>1 Тогда 
                Товары.Добавить(МассивРазделительНХ[0]); 
                НСтрока=Характеристики.Добавить();
                НСтрока.Товар=МассивРазделительНХ[0];
                НСтрока.Характеристика=МассивРазделительНХ[1];
            ИначеЕсли МассивРазделительНХ.Количество()=1 Тогда
                Товары.Добавить(МассивРазделительНХ[0]); 
            КонецЕсли;
        КонецЦикла;  	
    КонецЕсли;              
    
    Запрос.УстановитьПараметр("ОтборПоНоменклатуре",Товары.Количество()>0);
    Запрос.УстановитьПараметр("ОтборПоСкладу",Склады.Количество()>0);  
    //Запрос.УстановитьПараметр("ОтборПоХарактеристикам",Характеристики.Количество()>0);  
    Запрос.УстановитьПараметр("Номенклатура",Товары);
    Запрос.УстановитьПараметр("Склады",Склады);   
    //Запрос.УстановитьПараметр("Характеристики",Характеристики);  
    Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 13.09.2020 23:00:32
    //Запрос.Текст="ВЫБРАТЬ
    //|	смартИдентификаторыСоответствияБитрикс.ГУИД КАК ГУИД,
    //|	смартИдентификаторыСоответствияБитрикс.СсылкаМет КАК Номенклатура
    //|ПОМЕСТИТЬ Товары
    //|ИЗ
    //|	РегистрСведений.смартИдентификаторыСоответствияБитрикс КАК смартИдентификаторыСоответствияБитрикс
    //|ГДЕ
    //|	смартИдентификаторыСоответствияБитрикс.СсылкаМет ССЫЛКА Справочник.Номенклатура
    //|	И ВЫБОР
    //|			КОГДА &ОтборПоНоменклатуре
    //|				ТОГДА смартИдентификаторыСоответствияБитрикс.ГУИД В (&Номенклатура)
    //|			ИНАЧЕ ИСТИНА
    //|		КОНЕЦ
    //|;
    //|
    //|////////////////////////////////////////////////////////////////////////////////
    //|ВЫБРАТЬ
    //|	смартИдентификаторыСоответствияБитрикс.ГУИД КАК ГУИД,
    //|	смартИдентификаторыСоответствияБитрикс.СсылкаМет КАК Склад
    //|ПОМЕСТИТЬ Склады
    //|ИЗ
    //|	РегистрСведений.смартИдентификаторыСоответствияБитрикс КАК смартИдентификаторыСоответствияБитрикс
    //|ГДЕ
    //|	смартИдентификаторыСоответствияБитрикс.СсылкаМет ССЫЛКА Справочник.Склады
    //|	И ВЫБОР
    //|			КОГДА &ОтборПоСкладу
    //|				ТОГДА смартИдентификаторыСоответствияБитрикс.ГУИД В (&Склады)
    //|			ИНАЧЕ ИСТИНА
    //|		КОНЕЦ
    //|;
    //|
    //|////////////////////////////////////////////////////////////////////////////////
    //|ВЫБРАТЬ
    //|	ВложенныйЗапрос.Склад КАК Склад,
    //|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
    //|	МИНИМУМ(ВложенныйЗапрос.ДатаСобытия) КАК ДатаСобытия,
    //|	СУММА(ВложенныйЗапрос.Остаток) КАК Остаток
    //|ПОМЕСТИТЬ ПланируемыеОстатки
    //|ИЗ
    //|	(ВЫБРАТЬ
    //|	ГрафикПоступленияТоваровОстатки.Склад КАК Склад,
    //|	ГрафикПоступленияТоваровОстатки.Номенклатура КАК Номенклатура,
    //|	ВЫБОР
    //|		КОГДА ГрафикПоступленияТоваровОстатки.ДатаСобытия < &ТекДата
    //|			ТОГДА &ТекДата
    //|		ИНАЧЕ ГрафикПоступленияТоваровОстатки.ДатаСобытия
    //|	КОНЕЦ КАК ДатаСобытия,
    //|	ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовОстаток КАК Остаток
    //|ИЗ
    //|	РегистрНакопления.ГрафикПоступленияТоваров.Остатки(
    //|			,
    //|			Номенклатура В
    //|					(ВЫБРАТЬ
    //|						Товары.Номенклатура
    //|					ИЗ
    //|						Товары)
    //|				И Склад В ИЕРАРХИИ
    //|					(ВЫБРАТЬ
    //|						Склады.Склад
    //|					ИЗ
    //|						Склады)) КАК ГрафикПоступленияТоваровОстатки
    //|
    //|ОБЪЕДИНИТЬ ВСЕ
    //|
    //|ВЫБРАТЬ
    //|	ГрафикОтгрузкиТоваровОстатки.Склад,
    //|	ГрафикОтгрузкиТоваровОстатки.Номенклатура,
    //|	ВЫБОР
    //|		КОГДА ГрафикОтгрузкиТоваровОстатки.ДатаОтгрузки <= &ТекДата
    //|			ТОГДА &ТекДата
    //|		ИНАЧЕ """"
    //|	КОНЕЦ,
    //|	-ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток
    //|ИЗ
    //|	РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(
    //|			,
    //|			Номенклатура В
    //|					(ВЫБРАТЬ
    //|						Товары.Номенклатура
    //|					ИЗ
    //|						Товары)
    //|				И Склад В ИЕРАРХИИ
    //|					(ВЫБРАТЬ
    //|						Склады.Склад
    //|					ИЗ
    //|						Склады)) КАК ГрафикОтгрузкиТоваровОстатки) КАК ВложенныйЗапрос

    //|
    //|СГРУППИРОВАТЬ ПО
    //|	ВложенныйЗапрос.Склад,
    //|	ВложенныйЗапрос.Номенклатура
    //|
    //|ИМЕЮЩИЕ
    //|	СУММА(ВложенныйЗапрос.Остаток) > 0
    //|;
    //|
    //|////////////////////////////////////////////////////////////////////////////////
    //|ВЫБРАТЬ
    //|	ЕСТЬNULL(СвободныеОстатки.Склад, ПланируемыеОстатки.Склад) КАК Склад,
    //|	ЕСТЬNULL(СвободныеОстатки.Номенклатура, ПланируемыеОстатки.Номенклатура) КАК Номенклатура,
    //|	СвободныеОстатки.ВНаличииОстаток - ЕСТЬNULL(СвободныеОстатки.ВРезервеСоСкладаОстаток, 0) КАК Остаток,
    //|	ПланируемыеОстатки.ДатаСобытия КАК ДатаПоступления,
    //|	ПланируемыеОстатки.Остаток КАК КоличествоПоступления
    //|ПОМЕСТИТЬ ВТ
    //|ИЗ
    //|	РегистрНакопления.СвободныеОстатки.Остатки(
    //|			,
    //|			Номенклатура В
    //|					(ВЫБРАТЬ
    //|						Товары.Номенклатура
    //|					ИЗ
    //|						Товары)
    //|				И Склад В ИЕРАРХИИ
    //|					(ВЫБРАТЬ
    //|						СКЛАДЫ.Склад
    //|					ИЗ
    //|						СКЛАДЫ)) КАК СвободныеОстатки
    //|		ПОЛНОЕ СОЕДИНЕНИЕ ПланируемыеОстатки КАК ПланируемыеОстатки
    //|		ПО СвободныеОстатки.Номенклатура = ПланируемыеОстатки.Номенклатура
    //|			И (ПланируемыеОстатки.Склад = СвободныеОстатки.Склад)
    //|;
    //|
    //|////////////////////////////////////////////////////////////////////////////////
    //|ВЫБРАТЬ
    //|	Склады.ГУИД КАК Склад,
    //|	Товары.ГУИД КАК Номенклатура,
    //|	МАКСИМУМ(ВТ.Остаток) КАК Остаток,
    //|	ВТ.ДатаПоступления КАК ДатаПоступления,
    //|	ВТ.КоличествоПоступления КАК КоличествоПоступления
    //|ИЗ
    //|	ВТ КАК ВТ
    //|		ЛЕВОЕ СОЕДИНЕНИЕ Товары КАК Товары
    //|		ПО (ВТ.Номенклатура = Товары.Номенклатура)
    //|		ЛЕВОЕ СОЕДИНЕНИЕ Склады КАК Склады
    //|		ПО (ВЫБОР
    //|				КОГДА Склады.Склад.ЭтоГруппа
    //|					ТОГДА ВТ.Склад.Родитель = Склады.Склад
    //|				ИНАЧЕ ВТ.Склад = Склады.Склад
    //|			КОНЕЦ)
    //|ГДЕ
    //|	(ВТ.Остаток > 0
    //|			ИЛИ ВТ.КоличествоПоступления > 0)
    //|
    //|СГРУППИРОВАТЬ ПО
    //|	Склады.ГУИД,
    //|	Товары.ГУИД,
    //|	ВТ.ДатаПоступления,
    //|	ВТ.КоличествоПоступления
    //|
    //|УПОРЯДОЧИТЬ ПО
    //|	ДатаПоступления
    //|ИТОГИ ПО
    //|	Склад,
    //|	Номенклатура";   
    
    Запрос.Текст="ВЫБРАТЬ
    |   смартИдентификаторыСоответствияБитрикс.ГУИД КАК ГУИД,
    |   смартИдентификаторыСоответствияБитрикс.СсылкаМет КАК Номенклатура
    |ПОМЕСТИТЬ Товары
    |ИЗ
    |   РегистрСведений.смартИдентификаторыСоответствияБитрикс КАК смартИдентификаторыСоответствияБитрикс
    |ГДЕ
    |   смартИдентификаторыСоответствияБитрикс.СсылкаМет ССЫЛКА Справочник.Номенклатура
    |   И ВЫБОР
    |           КОГДА &ОтборПоНоменклатуре
    |               ТОГДА смартИдентификаторыСоответствияБитрикс.ГУИД В (&Номенклатура)
    |           ИНАЧЕ ИСТИНА
    |       КОНЕЦ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   смартИдентификаторыСоответствияБитрикс.ГУИД КАК ГУИД,
    |   смартИдентификаторыСоответствияБитрикс.СсылкаМет КАК Склад
    |ПОМЕСТИТЬ Склады
    |ИЗ
    |   РегистрСведений.смартИдентификаторыСоответствияБитрикс КАК смартИдентификаторыСоответствияБитрикс
    |ГДЕ
    |   смартИдентификаторыСоответствияБитрикс.СсылкаМет ССЫЛКА Справочник.Склады
    |   И ВЫБОР
    |           КОГДА &ОтборПоСкладу
    |               ТОГДА смартИдентификаторыСоответствияБитрикс.ГУИД В (&Склады)
    |           ИНАЧЕ ИСТИНА
    |       КОНЕЦ
    |;
    |       ////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВложенныйЗапрос.Склад КАК Склад,
    |   ВложенныйЗапрос.Номенклатура КАК Номенклатура,
    |   МИНИМУМ(ВложенныйЗапрос.ДатаСобытия) КАК ДатаСобытия,
    |   СУММА(ВложенныйЗапрос.Остаток) КАК Остаток,
    |   ВложенныйЗапрос.Характеристика КАК Характеристика
    |ПОМЕСТИТЬ ПланируемыеОстатки
    |ИЗ
    |   (ВЫБРАТЬ
    |       ГрафикПоступленияТоваровОстатки.Склад КАК Склад,
    |       ГрафикПоступленияТоваровОстатки.Номенклатура КАК Номенклатура,
    |       ВЫБОР
    |           КОГДА ГрафикПоступленияТоваровОстатки.ДатаСобытия < &ТекДата
    |               ТОГДА &ТекДата
    |           ИНАЧЕ ГрафикПоступленияТоваровОстатки.ДатаСобытия
    |       КОНЕЦ КАК ДатаСобытия,
    |       ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовОстаток КАК Остаток,
    |       ГрафикПоступленияТоваровОстатки.Характеристика КАК Характеристика
    |   ИЗ
    |       РегистрНакопления.ГрафикПоступленияТоваров.Остатки(
    |               ,
    |               Номенклатура В
    |                       (ВЫБРАТЬ
    |                           Товары.Номенклатура
    |                       ИЗ
    |                           Товары)
    |                   И Склад В ИЕРАРХИИ
    |                       (ВЫБРАТЬ
    |                           Склады.Склад
    |                       ИЗ
    |                           Склады)) КАК ГрафикПоступленияТоваровОстатки
    |   
    |   ОБЪЕДИНИТЬ ВСЕ
    |   
    |   ВЫБРАТЬ
    |       ГрафикОтгрузкиТоваровОстатки.Склад,
    |       ГрафикОтгрузкиТоваровОстатки.Номенклатура,
    |       ВЫБОР
    |           КОГДА ГрафикОтгрузкиТоваровОстатки.ДатаОтгрузки <= &ТекДата
    |               ТОГДА &ТекДата
    |           ИНАЧЕ """"
    |       КОНЕЦ,
    |       -ГрафикОтгрузкиТоваровОстатки.КоличествоИзЗаказовОстаток,
    |       ГрафикОтгрузкиТоваровОстатки.Характеристика
    |   ИЗ
    |       РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(
    |               ,
    |               Номенклатура В
    |                       (ВЫБРАТЬ
    |                           Товары.Номенклатура
    |                       ИЗ
    |                           Товары)
    |                   И Склад В ИЕРАРХИИ
    |                       (ВЫБРАТЬ
    |                           Склады.Склад
    |                       ИЗ
    |                           Склады)) КАК ГрафикОтгрузкиТоваровОстатки) КАК ВложенныйЗапрос
    |
    |СГРУППИРОВАТЬ ПО
    |   ВложенныйЗапрос.Склад,
    |   ВложенныйЗапрос.Номенклатура,
    |   ВложенныйЗапрос.Характеристика
    |
    |ИМЕЮЩИЕ
    |   СУММА(ВложенныйЗапрос.Остаток) > 0
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ЕСТЬNULL(СвободныеОстатки.Склад, ПланируемыеОстатки.Склад) КАК Склад,
    |   ЕСТЬNULL(СвободныеОстатки.Номенклатура, ПланируемыеОстатки.Номенклатура) КАК Номенклатура,
    |   ЕСТЬNULL(СвободныеОстатки.Характеристика, ПланируемыеОстатки.Характеристика) КАК Характеристика,
    |   СвободныеОстатки.ВНаличииОстаток - ЕСТЬNULL(СвободныеОстатки.ВРезервеСоСкладаОстаток, 0) КАК Остаток,
    |   ПланируемыеОстатки.ДатаСобытия КАК ДатаПоступления,
    |   ПланируемыеОстатки.Остаток КАК КоличествоПоступления
    |ПОМЕСТИТЬ ВТ
    |ИЗ
    |   РегистрНакопления.СвободныеОстатки.Остатки(
    |           ,
    |           Номенклатура В
    |                   (ВЫБРАТЬ
    |                       Товары.Номенклатура
    |                   ИЗ
    |                       Товары)
    |               И Склад В ИЕРАРХИИ
    |                   (ВЫБРАТЬ
    |                       СКЛАДЫ.Склад
    |                   ИЗ
    |                       СКЛАДЫ)) КАК СвободныеОстатки
    |       ПОЛНОЕ СОЕДИНЕНИЕ ПланируемыеОстатки КАК ПланируемыеОстатки
    |       ПО СвободныеОстатки.Номенклатура = ПланируемыеОстатки.Номенклатура
    |           И (ПланируемыеОстатки.Склад = СвободныеОстатки.Склад)
    |           И СвободныеОстатки.Характеристика = ПланируемыеОстатки.Характеристика
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   Склады.ГУИД КАК Склад,
    |   ВТ.Склад КАК СкладСС,
    |   Товары.ГУИД КАК Номенклатура,
    |   ВТ.Номенклатура КАК НоменклатураСС,
    |   ВТ.Характеристика КАК ХарактеристикаСС,
    |   СУММА(ВТ.Остаток) КАК Остаток,
    |   ВТ.ДатаПоступления КАК ДатаПоступления,
    |   ВТ.КоличествоПоступления КАК КоличествоПоступления
    |ИЗ
    |   ВТ КАК ВТ
    |       ЛЕВОЕ СОЕДИНЕНИЕ Товары КАК Товары
    |       ПО ВТ.Номенклатура = Товары.Номенклатура
    |       ЛЕВОЕ СОЕДИНЕНИЕ Склады КАК Склады
    |       ПО (ВЫБОР
    |               КОГДА Склады.Склад.ЭтоГруппа
    |                   ТОГДА ВТ.Склад.Родитель = Склады.Склад
    |               ИНАЧЕ ВТ.Склад = Склады.Склад
    |           КОНЕЦ)
    |            ГДЕ
    |   (ВТ.Остаток > 0
    |           ИЛИ ВТ.КоличествоПоступления > 0)
    |
    |СГРУППИРОВАТЬ ПО
    |   Склады.ГУИД,
    |   Товары.ГУИД,
    |   ВТ.ДатаПоступления,
    |   ВТ.КоличествоПоступления,
    |   ВТ.Характеристика,
    |   ВТ.Склад,
    |   ВТ.Номенклатура
    |
    |УПОРЯДОЧИТЬ ПО
    |   ДатаПоступления
    |ИТОГИ ПО
    |   Склад,
    |   Номенклатура";
    
	//Смарт }Подкин Алексей Иванович 13.09.2020 23:00:32
	МассивРезультата=Новый Массив;
	
	Склады=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Склады.Следующий() Цикл
		Склад=Новый Структура("store,leftover",Склады.Склад,Новый Массив);
		Товары=Склады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Товары.Следующий() Цикл 
			//Данные=Новый Структура("product,quantity",Товары.Номенклатура,?(ЗначениеЗаполнено(Товары.Остаток),Товары.Остаток,0));
			Планы=Товары.Выбрать();
            Пока Планы.Следующий() Цикл
                
                Если ЗначениеЗаполнено(Планы.ХарактеристикаСС) Тогда   
                    ОтборХарактеристик=Новый Структура("Товар",Планы.Номенклатура); 
                    МассивНайденных=Характеристики.НайтиСтроки(ОтборХарактеристик); 
                    Если МассивНайденных.Количество() Тогда 
                        Нашли=Ложь;
                        Для каждого ОбходМассива Из МассивНайденных Цикл
                            Если ОбходМассива.Характеристика=XMLСтрока(Планы.ХарактеристикаСС) Тогда   
                                Нашли=Истина;
                            КонецЕсли;
                        КонецЦикла; 
                        Если Нашли Тогда
                            Данные=Новый Структура("product,quantity",Планы.Номенклатура+"#"+XMLСтрока(Планы.ХарактеристикаСС),?(ЗначениеЗаполнено(Планы.Остаток),Планы.Остаток,0)); 
                        Иначе
                            Продолжить;
                        КонецЕсли;
                    Иначе
                        Данные=Новый Структура("product,quantity",Планы.Номенклатура,?(ЗначениеЗаполнено(Планы.Остаток),Планы.Остаток,0));
                    КонецЕсли;
                    
                Иначе
                    Данные=Новый Структура("product,quantity",Планы.Номенклатура,?(ЗначениеЗаполнено(Планы.Остаток),Планы.Остаток,0));
                КонецЕсли;  
                
                Если ЗначениеЗаполнено(Планы.КоличествоПоступления) Тогда
                    Если Не Данные.Свойство("plan") Тогда
                        Данные.Вставить("plan",Новый  Массив);
                    КонецЕсли;
                    Данные.plan.Добавить(Новый Структура("date,quantity",Формат(Планы.ДатаПоступления,"ДЛФ=D"),Планы.КоличествоПоступления));
                КонецЕсли;   
                
                Склад.leftover.Добавить(Данные); 
                
			КонецЦикла;
			//Склад.leftover.Добавить(Данные);
        КонецЦикла;	
        Если Склад.leftover.Количество() Тогда
            МассивРезультата.Добавить(Склад);
        КонецЕсли;
    КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	//rnp закомментировано 27.10.2021
	// это для теста
	//Попытка
	//	ТестПолученияЗапросаНаПолучениеНовыхДанных(МассивРезультата,"Остатки");
	//Исключение
	//КонецПопытки;
	
	Возврат ДанныеВСтрокуJSON(МассивРезультата);
	
КонецФункции	

Функция ПолучитьВзаиморасчетыСКлиентами(ДанныеЗапроса)  
	УстановитьПривилегированныйРежим(Истина);
	
	Данные=СтрокуJSONВДанные(ДанныеЗапроса);
	
	Партнер=Неопределено;
	Данные.Свойство("PARTNER",Партнер);
	Контрагенты=Неопределено;
	Данные.Свойство("CONTRAGENTS",Контрагенты);

	//++#1282 смарт: Лопато 10.01.2023 //Ошибки в работе механизма Состояние взаиморасчетов
	Результат=Новый Массив;
	
	Если ЗначениеЗаполнено(Контрагенты) И ЗначениеЗаполнено(Партнер) Тогда
	//--#1282 смарт: Лопато 10.01.2023
	
	//++ #Б-1742 смарт: Лопато 04.02.2025 //Обмен с ИМ. Изменение по взаиморасчетам, выгружаемым на сайт  
	ТаблицаВзаиморасчетов = смартИнтернетМагазин.ВзаиморасчетыПолучение(Партнер, Контрагенты, Ложь); 
	//-- #Б-1742 смарт: Лопато 04.02.2025
		
	Для Каждого Стр Из ТаблицаВзаиморасчетов Цикл 
		//++#1282 смарт: Лопато 10.01.2023 //Ошибки в работе механизма Состояние взаиморасчетов
		//Данные=Новый Структура("PARTNER,CONTRAGENT,XML_ID,CONTRACT,NUMBER,CURRENCY,TERM,DEBIT,OSTATOK,DOPUSTIMAYASUMMA,RESERV");  
		Данные=Новый Структура("PARTNER,CONTRAGENT,XML_ID,CONTRACT,NUMBER,CURRENCY,TERM,TERMEND,VALID,DEBIT,OSTATOK,DOPUSTIMAYASUMMA,RESERV,AVANS");  
		//--#1282 смарт: Лопато 10.01.2023
		ЗаполнитьЗначенияСвойств(Данные,Стр);
		//++ #Б-1742 смарт: Лопато 04.02.2025 //Обмен с ИМ. Изменение по взаиморасчетам, выгружаемым на сайт  
        ПолученныйХЭШ = смартИнтернетМагазин.MD5ХешСтрока(Стр.Контрагент.Наименование + "" + Стр.Партнер.Наименование + "" + Стр.Договор);
		//-- #Б-1742 смарт: Лопато 04.02.2025
		Данные.XML_ID 			= XMLСтрока(ПолученныйХЭШ); 
		Данные.TERM=XMLСтрока(Формат(Стр.TERM,"ДФ=yyyy-MM-dd"));
		Данные.CURRENCY=Стр.CURRENCY;
		Данные.CONTRACT=Стр.Договор;
		Данные.PARTNER=XMLСтрока(Стр.Партнер);
		Данные.CONTRAGENT=XMLСтрока(Стр.Контрагент);
		//++#1282 смарт: Лопато 10.01.2023 //Ошибки в работе механизма Состояние взаиморасчетов
		Данные.TERMEND = XMLСтрока(Формат(Стр.TERMEND,"ДФ=yyyy-MM-dd; ДП=0001-01-01"));
		Данные.VALID   = XMLСтрока(Стр.VALID);
		//--#1282 смарт: Лопато 10.01.2023
		
		Результат.Добавить(Данные);
	КонецЦикла;	

	//++#1282 смарт: Лопато 10.01.2023 //Ошибки в работе механизма Состояние взаиморасчетов
	КонецЕсли;	
	//--#1282 смарт: Лопато 10.01.2023
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ДанныеВСтрокуJSON(Результат);
КонецФункции	

//++#1311 смарт: Лопато 03.04.2023 //Изменить форму Счета на оплату (Счет-оферта)  
Функция ПолучитьТекстОфертыЗаказаДляСайта(ДанныеЗапроса)

	УстановитьПривилегированныйРежим(Истина);

	Данные = СтрокуJSONВДанные(ДанныеЗапроса);

	ЗаказГуид = Неопределено;
	Данные.Свойство("order", ЗаказГуид);

	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ЗаказГуид) Тогда
		
		ЗаказСсылка = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗаказГуид));
		
		Если ЗначениеЗаполнено(ЗаказСсылка) Тогда
			
			ТекстОферта = смартОбщегоНазначения.смартСформироватьТекстОферты(ЗаказСсылка);
			ТекстОфертаСайт = Б_ОбменССайтомСерверВыгрузкаДанных.смартДополнитьТекстТегами(ТекстОферта);
			
			Данные = Новый Структура("OFERTA", XMLСтрока(ТекстОфертаСайт));  
			
			Результат.Добавить(Данные);

		КонецЕсли;	

	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеВСтрокуJSON(Результат);
	
КонецФункции //--#1311 смарт: Лопато 03.04.2023

//++ #Б-1368 смарт: Лопато 19.11.2024 //Печать счета по форме 1С из ИМ. Подготовить API для выгрузки файла Счета-оферты в PDF.  
Процедура УстановитьВОтветСообщениеОбОшибке(Ответ, КодСостояния, Сообщение)

	Ответ.КодСостояния = КодСостояния;
	Ответ.Заголовки.Вставить("Content-Type", "text/html;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Сообщение, КодировкаТекста.UTF8);
    Ответ.Причина = Сообщение;
	
КонецПроцедуры //-- #Б-1368 смарт: Лопато 19.11.2024

//++ #Б-1652 смарт: Лопато 18.12.2024 //Добавить раздел "Мое оборудование". Создать ветку API, подготовить структуру ответа  
Функция ПолучитьДанныеПоОборудованиюПартнера(Партнер) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Период КАК ДатаПродажи,
		|	АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	АналитикаУчетаНоменклатуры.Серия КАК Серия
		|ПОМЕСТИТЬ ОборудованиеКлиентов
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|		,
		|		,
		|		ДЕНЬ,
		|		АналитикаУчетаПоПартнерам.Партнер = &Партнер
		|		И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры)
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДатаПродажи КАК ДатаПродажи,
		|	Номенклатура КАК Номенклатура,
		|	Серия КАК Серия,
		|	Серия.Номер КАК НомерСерии
		|ИЗ 
		|	ОборудованиеКлиентов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПродажи,
		|	Номенклатура,
		|	Серия,
		|	НомерСерии
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		//++ #Б3006 смарт: Шляпников 17.04.2025 / Не корректно подставляется номенклатура по оборудованию клиента в Заявке на ремонт
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТехОбслуживание.ДатаТОУКлиента КАК ДатаТОУКлиента,
		|	Чернила.Номенклатура КАК Номенлатура,
		|	ТехОбслуживание.Серия КАК Серия,
		|	ТехОбслуживание.Запчасть КАК Запчасть
		|ИЗ
		|	РегистрСведений.смартТехническоеОбслуживаниеОборудованияПоКлиентам КАК ТехОбслуживание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК Чернила
		|		ПО ТехОбслуживание.Оборудование = Чернила.ОборудованиеКлиентов
		|		И Чернила.СопоставлениеСТоваром
		|ГДЕ
		|	(ТехОбслуживание.Клиент, Чернила.Номенклатура, ТехОбслуживание.Серия) 
		|		В (ВЫБРАТЬ Клиент, Номенклатура, Серия ИЗ ОборудованиеКлиентов)
		|
		//-- #Б3006 смарт: Шляпников 17.04.2025
		|УПОРЯДОЧИТЬ ПО
		|	ДатаТОУКлиента,
		|	Номенлатура,
		|	Серия,
		|	Запчасть
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ВидНоменклатуры", 
		Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	ТаблицаПоОборудованию = РезультатЗапроса[1].Выгрузить();
	ТаблицаПоОбслуживанию = РезультатЗапроса[2].Выгрузить();
	
	Для Каждого СтрОборудование Из ТаблицаПоОборудованию Цикл 

		//Оборудование
		СтруктураОборудование = Новый Структура("ID, Name, Serial, DateOfSale, Maintenance");
		
		СтруктураОборудование.ID 		 = XMLСтрока(СтрОборудование.Номенклатура);
		СтруктураОборудование.Name 		 = СокрЛП(СтрОборудование.Номенклатура);
		СтруктураОборудование.Serial 	 = СокрЛП(СтрОборудование.НомерСерии);
		СтруктураОборудование.DateOfSale = Формат(СтрОборудование.ДатаПродажи, "ДФ=yyyy-MM-dd");
		
		//Обслуживание
		МассивОбслуживание = Новый Массив;	

		ОтборОбслуживание = Новый Структура;
		ОтборОбслуживание.Вставить("Номенлатура", СтрОборудование.Номенклатура);
		ОтборОбслуживание.Вставить("Серия", 	  СтрОборудование.Серия);
		
		СтрокиОбслуживание = ТаблицаПоОбслуживанию.НайтиСтроки(ОтборОбслуживание);

		Для Каждого СтрокаОбслуживание Из СтрокиОбслуживание Цикл
		
			СтруктураОбслуживание = Новый Структура("DateOFMaintenance, NameOfSparePart");

			СтруктураОбслуживание.DateOFMaintenance = Формат(СтрокаОбслуживание.ДатаТОУКлиента, "ДФ=yyyy-MM-dd");
			СтруктураОбслуживание.NameOfSparePart	= СокрЛП(СтрокаОбслуживание.Запчасть);
			
			МассивОбслуживание.Добавить(СтруктураОбслуживание);
			
		КонецЦикла;

		СтруктураОборудование.Вставить("Maintenance", МассивОбслуживание);
		
		Результат.Добавить(СтруктураОборудование);
		
	КонецЦикла;	
	
	Возврат ДанныеВСтрокуJSON(Результат);
	
КонецФункции //-- #Б-1652 смарт: Лопато 18.12.2024	
	
#КонецОбласти


#Область ПрочиеПроцедурыФункции

Функция ДанныеВСтрокуJSON(Данные)
	Запись=Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(Запись,Данные);
	Возврат Запись.Закрыть();
КонецФункции	

Функция СтрокуJSONВДанные(Стр)
	Чтение=Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Стр);
	Данные=ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	Возврат Данные;
КонецФункции	

Функция ПолучитьСсылкиПоГУИД(МассивГуидов,Имя,Тип="Справочник")
	МассивСсылок=Новый Массив;
	Для Каждого Эл Из МассивГуидов Цикл
		Если Тип="Справочник" Тогда 
			МассивСсылок.Добавить(Справочники[Имя].ПолучитьСсылку(Новый УникальныйИдентификатор(Эл)));
		ИначеЕсли Тип="Документ" Тогда 
			МассивСсылок.Добавить(Документы[Имя].ПолучитьСсылку(Новый УникальныйИдентификатор(Эл)));
		КонецЕсли;	
	КонецЦикла;
	Возврат МассивСсылок;
КонецФункции

Процедура ТестПолученияЗапросаНаПолучениеНовыхДанных(Данные,Тема)
	УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ДанныеДляОтправки=Новый Структура;
	ДанныеДляОтправки.Вставить("Кому","debugging1c@smart-t.ru"); //+-#1207 смарт: Каратеев 06.10.2022 //Замена получателя рассылки.
	ДанныеДляОтправки.Вставить("Тема",Тема+" "+СтрокаСоединенияИнформационнойБазы()); //+-#1207 смарт: Каратеев 18.10.2022 //Добавление инфо из базы рассылки.
	ДанныеДляОтправки.Вставить("Тело",ДанныеВСтрокуJSON(Данные));
	ДанныеДляОтправки.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.ПростойТекст);
	ДанныеДляОтправки.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Высокая);
	
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ДанныеДляОтправки);
КонецПроцедуры	

#КонецОбласти
